opencds-parent/opencds-decision-support-service/opencds-knowledge-repository-data/resources_v1.1/pacientes/SampleSOAPWrapperForBeaconProject.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:dss="http://www.omg.org/spec/CDSS/201105/dss">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <dss:evaluate>
            <interactionId scopingEntityId="edu.utah.bmi" interactionId="123456" submissionTime="2012-01-26T07:59:35.123"/>
            <evaluationRequest clientLanguage="" clientTimeZoneOffset="">
                <kmEvaluationRequest>
                    <kmId scopingEntityId="org.opencds" businessId="ReportableDisease" version="1.1.0"/>
                </kmEvaluationRequest>
                <dataRequirementItemData>
                    <driId itemId="labPayload">
                        <containingEntityId scopingEntityId="edu.utah.hsc" businessId="EnterpriseDataWarehouse" version="1.0.0"/>
                    </driId>
                    <data>
                        <informationModelSSId scopingEntityId="org.opencds.vmr" businessId="VMR" version="1.0"/>
                        <base64EncodedPayload>BASE64ENCODEDCONTENT</base64EncodedPayload>
                    </data>
                </dataRequirementItemData>
            </evaluationRequest>
        </dss:evaluate>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
