3/ice-request-with-data-2.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
	<S:Body>
		<ns2:evaluateAtSpecifiedTime xmlns:ns2="http://www.omg.org/spec/CDSS/201105/dss">
			<interactionId scopingEntityId="gov.nyc.health" interactionId="123456"/>
			<specifiedTime>2024-10-13T00:00:00.000-10:00</specifiedTime>
			<evaluationRequest clientLanguage="" clientTimeZoneOffset="">
				<kmEvaluationRequest>
					<kmId scopingEntityId="org.nyc.cir" businessId="ICE" version="1.0.0"/>
				</kmEvaluationRequest>
				<dataRequirementItemData>
					<driId itemId="cdsPayload">
						<containingEntityId scopingEntityId="gov.nyc.health" businessId="ICEData" version="1.0.0.0"/>
					</driId>
					<data>
						<informationModelSSId scopingEntityId="org.opencds.vmr" businessId="VMR" version="1.0"/>
						<base64EncodedPayload></base64EncodedPayload>
					</data>
				</dataRequirementItemData>
			</evaluationRequest>
		</ns2:evaluateAtSpecifiedTime>
	</S:Body>
</S:Envelope>